driver-tests/bpelse/foreach-bpel20/ForEachJbi/test/forEach_basic2/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="http://localhost/ForEachBpel/forEach_basic2">
  <soapenv:Body>
    <for:part1>4</for:part1>
    <for:part2>8</for:part2>
    <for:part3>0</for:part3>
  </soapenv:Body>
</soapenv:Envelope>